Model: "Generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden_space (InputLayer)    [(None, 100)]             0         
_________________________________________________________________
dense (Dense)                (None, 50176)             5067776   
_________________________________________________________________
batch_normalization (BatchNo (None, 50176)             200704    
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 1024)        0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       2097280   
_________________________________________________________________
batch_normalization_1 (Batch (None, 14, 14, 128)       512       
_________________________________________________________________
tf_op_layer_Relu (TensorFlow [(None, 14, 14, 128)]     0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 14, 14, 64)        131136    
_________________________________________________________________
batch_normalization_2 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
tf_op_layer_Relu_1 (TensorFl [(None, 14, 14, 64)]      0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 28, 28, 32)        32800     
_________________________________________________________________
batch_normalization_3 (Batch (None, 28, 28, 32)        128       
_________________________________________________________________
tf_op_layer_Relu_2 (TensorFl [(None, 28, 28, 32)]      0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 28, 28, 1)         513       
_________________________________________________________________
images (Activation)          (None, 28, 28, 1)         0         
=================================================================
Total params: 7,531,105
Trainable params: 7,430,305
Non-trainable params: 100,800
_________________________________________________________________


Model: "Discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
images (InputLayer)          [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 14, 14, 32)        544       
_________________________________________________________________
tf_op_layer_Relu_3 (TensorFl [(None, 14, 14, 32)]      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        32832     
_________________________________________________________________
batch_normalization_4 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
tf_op_layer_Relu_4 (TensorFl [(None, 14, 14, 64)]      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         131200    
_________________________________________________________________
batch_normalization_5 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
tf_op_layer_Relu_5 (TensorFl [(None, 7, 7, 128)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 6272)              0         
_________________________________________________________________
hidden_space (Dense)         (None, 100)               627300    
_________________________________________________________________
dense_1 (Dense)              (None, 50176)             5067776   
_________________________________________________________________
batch_normalization_6 (Batch (None, 50176)             200704    
_________________________________________________________________
tf_op_layer_Relu_6 (TensorFl [(None, 50176)]           0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 7, 7, 1024)        0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 14, 14, 128)       2097280   
_________________________________________________________________
batch_normalization_7 (Batch (None, 14, 14, 128)       512       
_________________________________________________________________
tf_op_layer_Relu_7 (TensorFl [(None, 14, 14, 128)]     0         
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 14, 14, 64)        131136    
_________________________________________________________________
batch_normalization_8 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
tf_op_layer_Relu_8 (TensorFl [(None, 14, 14, 64)]      0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 28, 28, 32)        32800     
_________________________________________________________________
batch_normalization_9 (Batch (None, 28, 28, 32)        128       
_________________________________________________________________
tf_op_layer_Relu_9 (TensorFl [(None, 28, 28, 32)]      0         
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 28, 28, 1)         513       
_________________________________________________________________
reconstructured_images (Acti (None, 28, 28, 1)         0         
=================================================================
Total params: 8,323,749
Trainable params: 8,222,565
Non-trainable params: 101,184
_________________________________________________________________


