Model: "Generator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
labels (InputLayer)             [(None, 1)]          0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 1, 10)        100         labels[0][0]                     
__________________________________________________________________________________________________
z (InputLayer)                  [(None, 100)]        0                                            
__________________________________________________________________________________________________
tf_op_layer_Squeeze (TensorFlow [(None, 10)]         0           embedding[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 110)          0           z[0][0]                          
                                                                 tf_op_layer_Squeeze[0][0]        
__________________________________________________________________________________________________
input_prog (Dense)              (None, 12544)        1379840     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 12544)        50176       input_prog[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Relu (TensorFlowOpL [(None, 12544)]      0           batch_normalization[0][0]        
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 7, 256)    0           tf_op_layer_Relu[0][0]           
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 7, 7, 128)    819200      reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 7, 128)    512         conv2d_transpose[0][0]           
__________________________________________________________________________________________________
tf_op_layer_Relu_1 (TensorFlowO [(None, 7, 7, 128)]  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 14, 14, 64)   204800      tf_op_layer_Relu_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 14, 14, 64)   256         conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Relu_2 (TensorFlowO [(None, 14, 14, 64)] 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 28, 28, 1)    1600        tf_op_layer_Relu_2[0][0]         
==================================================================================================
Total params: 2,456,484
Trainable params: 2,431,012
Non-trainable params: 25,472
__________________________________________________________________________________________________


Model: "Discriminator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
images (InputLayer)             [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 14, 14, 64)   1664        images[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_LeakyRelu (TensorFl [(None, 14, 14, 64)] 0           conv2d[0][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 14, 14, 64)   0           tf_op_layer_LeakyRelu[0][0]      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 128)    204928      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 7, 7, 128)    512         conv2d_1[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_LeakyRelu_1 (Tensor [(None, 7, 7, 128)]  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 7, 7, 128)    0           tf_op_layer_LeakyRelu_1[0][0]    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 4, 4, 256)    819456      dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 4, 4, 256)    1024        conv2d_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_LeakyRelu_2 (Tensor [(None, 4, 4, 256)]  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 4, 4, 256)    0           tf_op_layer_LeakyRelu_2[0][0]    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 4096)         0           dropout_2[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          2097664     flatten[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 512)          2048        dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_LeakyRelu_3 (Tensor [(None, 512)]        0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
logits_y (Dense)                (None, 1)            513         tf_op_layer_LeakyRelu_3[0][0]    
__________________________________________________________________________________________________
logits_aux_y (Dense)            (None, 10)           5130        tf_op_layer_LeakyRelu_3[0][0]    
==================================================================================================
Total params: 3,132,939
Trainable params: 3,131,147
Non-trainable params: 1,792
__________________________________________________________________________________________________


