Model: "Generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
z (InputLayer)               [(None, 100)]             0         
_________________________________________________________________
input_prog (Dense)           (None, 12544)             1254400   
_________________________________________________________________
batch_normalization (BatchNo (None, 12544)             50176     
_________________________________________________________________
tf_op_layer_LeakyRelu (Tenso [(None, 12544)]           0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 256)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 7, 7, 128)         819200    
_________________________________________________________________
batch_normalization_1 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
tf_op_layer_LeakyRelu_1 (Ten [(None, 7, 7, 128)]       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 14, 14, 64)        204800    
_________________________________________________________________
batch_normalization_2 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
tf_op_layer_LeakyRelu_2 (Ten [(None, 14, 14, 64)]      0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 28, 28, 1)         1600      
=================================================================
Total params: 2,330,944
Trainable params: 2,305,472
Non-trainable params: 25,472
_________________________________________________________________


Model: "critic"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
images (InputLayer)          [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 14, 14, 64)        1664      
_________________________________________________________________
tf_op_layer_LeakyRelu_3 (Ten [(None, 14, 14, 64)]      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 7, 7, 128)         204928    
_________________________________________________________________
tf_op_layer_LeakyRelu_4 (Ten [(None, 7, 7, 128)]       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 4, 256)         819456    
_________________________________________________________________
tf_op_layer_LeakyRelu_5 (Ten [(None, 4, 4, 256)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               2097664   
_________________________________________________________________
tf_op_layer_LeakyRelu_6 (Ten [(None, 512)]             0         
_________________________________________________________________
logits_y (Dense)             (None, 1)                 513       
=================================================================
Total params: 3,124,225
Trainable params: 3,124,225
Non-trainable params: 0
_________________________________________________________________


